diy_data_harvester/ndw_harvester/data/gebeurtenisinfo.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"><SOAP:Body><d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><exchange><supplierIdentification><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></supplierIdentification><subscription><operatingMode>operatingMode3</operatingMode><subscriptionStartTime>2021-10-20T11:04:23.426Z</subscriptionStartTime><subscriptionState>active</subscriptionState><updateMethod>snapshot</updateMethod><target><address/><protocol>HTTP</protocol></target></subscription></exchange><payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="SituationPublication" lang="nl"><publicationTime>2021-11-18T08:56:26.615Z</publicationTime><publicationCreator><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></publicationCreator><situation id="RWS02_0000361460" version="3"><overallSeverity>medium</overallSeverity><situationVersionTime>2021-11-18T08:54:23Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="RWS02_0000361460_361460" version="3"><situationRecordCreationTime>2021-11-18T08:50:09Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-18T08:54:23Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">Rijkswaterstaat</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-18T08:50:09Z</overallStartTime></validityTimeSpecification></validity><generalPublicComment><comment><values><value>RWS Weginspecteur</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Linear"><locationForDisplay><latitude>51.9221077</latitude><longitude>5.627902</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>mainCarriageway</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCLinear xsi:type="AlertCMethod4Linear"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>7499</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation><alertCMethod4SecondaryPointLocation><alertCLocation><specificLocation>7503</specificLocation></alertCLocation><offsetDistance><offsetDistance>0</offsetDistance></offsetDistance></alertCMethod4SecondaryPointLocation></alertCLinear><linearExtension><linearByCoordinatesExtension><linearCoordinatesStartPoint><pointCoordinates><latitude>51.9198456</latitude><longitude>5.655923</longitude></pointCoordinates></linearCoordinatesStartPoint><linearCoordinatesEndPoint><pointCoordinates><latitude>51.91971</latitude><longitude>5.563867</longitude></pointCoordinates></linearCoordinatesEndPoint></linearByCoordinatesExtension></linearExtension></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>mobile</mobilityType></mobilityOfObstruction><vehicleObstructionType>emergencyVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleUsage>roadOperator</vehicleUsage></vehicleCharacteristics></obstructingVehicle></situationRecord></situation><situation id="RWS02_0000361459" version="3"><overallSeverity>medium</overallSeverity><relatedSituation id="RWS03_131173" version="last" targetClass="Situation"/><situationVersionTime>2021-11-18T08:53:14Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="RWS02_0000361459_361459" version="3"><situationRecordCreationTime>2021-11-18T08:50:09Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-18T08:53:14Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">Rijkswaterstaat</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-18T08:50:09Z</overallStartTime></validityTimeSpecification></validity><generalPublicComment><comment><values><value>RWS Weginspecteur</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Point"><locationForDisplay><latitude>52.06843</latitude><longitude>5.071033</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>mainCarriageway</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCPoint xsi:type="AlertCMethod4Point"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>7990</specificLocation></alertCLocation><offsetDistance><offsetDistance>1300</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation></alertCPoint><pointByCoordinates><pointCoordinates><latitude>52.06843</latitude><longitude>5.071033</longitude></pointCoordinates></pointByCoordinates></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>stationary</mobilityType></mobilityOfObstruction><vehicleObstructionType>emergencyVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleUsage>roadOperator</vehicleUsage></vehicleCharacteristics></obstructingVehicle></situationRecord></situation><situation id="RWS02_0000361458" version="2"><overallSeverity>medium</overallSeverity><relatedSituation id="RWS03_131177" version="last" targetClass="Situation"/><situationVersionTime>2021-11-18T08:47:12Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="RWS02_0000361458_361458" version="2"><situationRecordCreationTime>2021-11-18T08:47:10Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-18T08:47:12Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">Rijkswaterstaat</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-18T08:47:10Z</overallStartTime></validityTimeSpecification></validity><generalPublicComment><comment><values><value>RWS Weginspecteur</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Point"><locationForDisplay><latitude>52.3782043</latitude><longitude>4.70819</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>entrySlipRoad</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCPoint xsi:type="AlertCMethod4Point"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>10586</specificLocation></alertCLocation><offsetDistance><offsetDistance>100</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation></alertCPoint><pointByCoordinates><pointCoordinates><latitude>52.3782043</latitude><longitude>4.70819</longitude></pointCoordinates></pointByCoordinates></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>stationary</mobilityType></mobilityOfObstruction><vehicleObstructionType>emergencyVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleUsage>roadOperator</vehicleUsage></vehicleCharacteristics></obstructingVehicle></situationRecord></situation><situation id="RWS02_0000361457" version="3"><overallSeverity>medium</overallSeverity><relatedSituation id="RWS03_131172" version="last" targetClass="Situation"/><situationVersionTime>2021-11-18T08:44:11Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="RWS02_0000361457_361457" version="3"><situationRecordCreationTime>2021-11-18T08:42:09Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-18T08:44:11Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">Rijkswaterstaat</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-18T08:42:09Z</overallStartTime></validityTimeSpecification></validity><generalPublicComment><comment><values><value>RWS Weginspecteur</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Point"><locationForDisplay><latitude>52.1318169</latitude><longitude>5.974302</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>mainCarriageway</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCPoint xsi:type="AlertCMethod4Point"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>positive</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>9415</specificLocation></alertCLocation><offsetDistance><offsetDistance>1400</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation></alertCPoint><pointByCoordinates><pointCoordinates><latitude>52.1318169</latitude><longitude>5.974302</longitude></pointCoordinates></pointByCoordinates></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>stationary</mobilityType></mobilityOfObstruction><vehicleObstructionType>emergencyVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleUsage>roadOperator</vehicleUsage></vehicleCharacteristics></obstructingVehicle></situationRecord></situation><situation id="RWS02_0000361430" version="14"><overallSeverity>medium</overallSeverity><relatedSituation id="RWS03_131133" version="last" targetClass="Situation"/><situationVersionTime>2021-11-18T07:39:17Z</situationVersionTime><headerInformation><confidentiality>noRestriction</confidentiality><informationStatus>real</informationStatus></headerInformation><situationRecord xsi:type="VehicleObstruction" id="RWS02_0000361430_361430" version="14"><situationRecordCreationTime>2021-11-18T07:07:10Z</situationRecordCreationTime><situationRecordVersionTime>2021-11-18T07:39:17Z</situationRecordVersionTime><probabilityOfOccurrence>certain</probabilityOfOccurrence><source><sourceName><values><value lang="nl">Rijkswaterstaat</value></values></sourceName></source><validity><validityStatus>definedByValidityTimeSpec</validityStatus><validityTimeSpecification><overallStartTime>2021-11-18T07:07:10Z</overallStartTime></validityTimeSpecification></validity><generalPublicComment><comment><values><value>RWS Weginspecteur</value></values></comment></generalPublicComment><groupOfLocations xsi:type="Point"><locationForDisplay><latitude>52.87386</latitude><longitude>5.743143</longitude></locationForDisplay><supplementaryPositionalDescription><affectedCarriagewayAndLanes><carriageway>entrySlipRoad</carriageway></affectedCarriagewayAndLanes></supplementaryPositionalDescription><alertCPoint xsi:type="AlertCMethod4Point"><alertCLocationCountryCode>8</alertCLocationCountryCode><alertCLocationTableNumber>6.4</alertCLocationTableNumber><alertCLocationTableVersion>A</alertCLocationTableVersion><alertCDirection><alertCDirectionCoded>negative</alertCDirectionCoded></alertCDirection><alertCMethod4PrimaryPointLocation><alertCLocation><specificLocation>9925</specificLocation></alertCLocation><offsetDistance><offsetDistance>300</offsetDistance></offsetDistance></alertCMethod4PrimaryPointLocation></alertCPoint><pointByCoordinates><pointCoordinates><latitude>52.87386</latitude><longitude>5.743143</longitude></pointCoordinates></pointByCoordinates></groupOfLocations><situationRecordExtension><situationRecordExtendedApproved><safetyRelatedMessage>true</safetyRelatedMessage></situationRecordExtendedApproved></situationRecordExtension><mobilityOfObstruction><mobilityType>stationary</mobilityType></mobilityOfObstruction><vehicleObstructionType>emergencyVehicle</vehicleObstructionType><obstructingVehicle><vehicleCharacteristics><vehicleUsage>roadOperator</vehicleUsage></vehicleCharacteristics></obstructingVehicle></situationRecord></situation></payloadPublication></d2LogicalModel></SOAP:Body></SOAP:Envelope>